#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

google_compute_managed_ssl_certificate.default: Refreshing state... [id=projects/cloudops-388321/global/sslCertificates/cloud-resume-cert-managed]
google_compute_global_address.default: Refreshing state... [id=projects/cloudops-388321/global/addresses/resume]
google_storage_bucket.default: Refreshing state... [id=davidbour-cloud-resume-db]
google_service_account.service_account: Refreshing state... [id=projects/cloudops-388321/serviceAccounts/cloud-run-invoker@cloudops-388321.iam.gserviceaccount.com]
google_compute_network.vpc: Refreshing state... [id=projects/cloudops-388321/global/networks/cloudops-388321-vpc]
google_project_iam_member.cloudrun-invoker: Refreshing state... [id=cloudops-388321/roles/run.invoker/serviceAccount:cloud-run-invoker@cloudops-388321.iam.gserviceaccount.com]
google_project_service.firebase_database: Refreshing state... [id=cloudops-388321/firebasedatabase.googleapis.com]
google_firebase_project.default: Refreshing state... [id=projects/cloudops-388321]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/cloudops-388321/regions/us-central1/subnetworks/cloudops-388321-subnet]
google_storage_bucket_iam_member.default: Refreshing state... [id=b/davidbour-cloud-resume-db/roles/storage.objectViewer/allUsers]
google_compute_backend_bucket.default: Refreshing state... [id=projects/cloudops-388321/global/backendBuckets/cloud-resume-db-backend-bucket]
google_container_cluster.primary: Refreshing state... [id=projects/cloudops-388321/locations/us-central1/clusters/cloudops-388321-gke]
google_compute_url_map.default: Refreshing state... [id=projects/cloudops-388321/global/urlMaps/http-lb]
google_container_node_pool.primary_nodes: Refreshing state... [id=projects/cloudops-388321/locations/us-central1/clusters/cloudops-388321-gke/nodePools/cloudops-388321-gke]
google_compute_target_https_proxy.default: Refreshing state... [id=projects/cloudops-388321/global/targetHttpsProxies/cloud-https-proxy]
google_compute_global_forwarding_rule.default: Refreshing state... [id=projects/cloudops-388321/global/forwardingRules/https-lb-forwarding-rule]
google_firebase_database_instance.default: Refreshing state... [id=projects/cloudops-388321/locations/us-central1/instances/cloudops-388321-default-rtdb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
      ~ cluster_ipv4_cidr           = "10.224.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "35.223.241.219" -> (known after apply)
      ~ id                          = "projects/cloudops-388321/locations/us-central1/clusters/cloudops-388321-gke" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.26.5-gke.1200" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "cloudops-388321-gke"
      ~ network                     = "projects/cloudops-388321/global/networks/cloudops-388321-vpc" -> "cloudops-388321-vpc"
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_locations              = [
          - "us-central1-a",
          - "us-central1-b",
          - "us-central1-c",
        ] -> (known after apply)
      ~ node_version                = "1.26.5-gke.1200" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "cloudops-388321" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/cloudops-388321/locations/us-central1/clusters/cloudops-388321-gke" -> (known after apply)
      ~ services_ipv4_cidr          = "10.227.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/cloudops-388321/regions/us-central1/subnetworks/cloudops-388321-subnet" -> "cloudops-388321-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)
        # (8 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRQll0Sitkc00vdk5CM29RSHRGOTFsREFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSbU9EZzVPVFkwT1MwM09XWXdMVFJsWmpBdFlXWm1aaTFqTjJFMU4yUmxaVFF3TWpRdwpJQmNOTWpNd056RXpNREl4T0RNM1doZ1BNakExTXpBM01EVXdNekU0TXpkYU1DOHhMVEFyQmdOVkJBTVRKR1k0Ck9EazVOalE1TFRjNVpqQXROR1ZtTUMxaFptWm1MV00zWVRVM1pHVmxOREF5TkRDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQU0yWWlhWnVWMm5VT2tQdnNzTWU2aVNCaENNbStmZ3Q3Mys0OGk3TQpBKytQNmR0RHFCNHZDNDQwMTJBeHBocmZxSVpQZVN0YnU4czZ1SXovRWkzQlI1ZzQ5ajRMK2NRQzZtbXRrb05uCkhkT0RTNHZzL1VYa0c4bXAvR3JZWTRoVkRHNng0OUJVcHNUSmpNZWt5N09JSllPbGt4OHdob01CR3hva0VGaFgKdXRVZG5UaWZyM0tNTUNaNmF5a2w3VWpSZk9MWHlEanVHK2pzR20vZEs5Z3JRWkRFNzh6L0tyWDRESVpsNHozSQp1eDV5Q1ViOWYyaWJGd0R2cDc5L1M1d0ZCQ2pzeVFGWWIvbVFQeXFLRHE5TEFXYXlKL2pTUWFwMXdSazN0TnhSCk5uQUFVdDR1eHhCNnZBby9vR0lKQXJ0dHk1clRrVjhTRlp3S0UvTzlvTVYyZitSOGVUV1FuUnZCWm1yODFCczcKRkJtZVdCd01VUHRiMzdpWEVEUXV5WjdPellrRmxOa3hnc1RXMU1QMnFOL1dkNG5BZ2dPVDdsc1FPUVorcmVpRgpYUk4rcVhucmd4QVBsNCtsL1k1RzRpUWFhSjNVY3JVM0kwSnhIbFJuRHBaU25qQmowSzBMamhwbkdtNk5VNHpVCkR6N2tqMC9kZzlLVFNRVzlwdk04UlZ6WXR3SURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVU3bzZVUDdxY08zRklZUFFJMUcrYmM3aUJaUTB3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFDbGZXTlN2SFRHUUxKTkhJdUZCL2s3RlFQREVpbmYvZFl5SWFiT2R5MUIrCm44VUkzNU9CVDQ4Zm1kaGNnK1oyZlVpb2RZblplTDVyc2E3OXVMRDc2blY0a2RWL2hBTTdJcGdTTmNKekxYWXIKbGlmZzhGYmE0YUxWYlFpQk5PbE93c3FES1pDODgrWTYvUk0vbHUyZDVhOHhEK1RweDlZUTBzOTYvQ1JYUlI2NApYN2YrTEFaQ09xWEFSUGNPUWNzbHRmMkUrbXdZU3piMktkeFdZV3dKNWdNVFpWL0xnSm05aWI3VDVXcXNpUTBKCnc3aWxWaURpL3NNQmNIcjZqSHZBaHMra1owU3hMWGRQWDZ3YmpialNrWjdMOU1VbmNlTVdodUlMZTlpcVc3K1YKZU5NSnB0UUdvUXFBS0hHMmdNMTk0dElFdU14WEdlS205dFBJUlJJNERvWHhJc0psOGpvaWdsbmVqU1FGeTQ2Vwo5T0EyUHlYenpnTzhOeC9HK2JBOFp2YmY4VGlLaGZTaVdVNWlUd0x5SWgrZVp0amFpT2pIbTVYQlNoTHJLU01VClpQaXZpb0dwbmY3SWMxZTFFdVAyK3VMc0szQkE2K0JLZTNqa1RHaWJBU2IrUzV3Sm85bmJGWC8zdThjRVJ5YXcKajFqZmZHRzZpdW5uZTIwOUgweUxVdz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      + node_config { # forces replacement
          + disk_size_gb      = 40 # forces replacement
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false # forces replacement
          + service_account   = (known after apply)
          + spot              = false # forces replacement
          + taint             = (known after apply)
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.10.0.2" -> null
          - public_endpoint         = "35.223.241.219" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "cloudops-388321-gke"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "cloudops-388321-gke"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "cloudops-388321"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + tags              = [
              + "gke-node",
              + "cloudops-388321-gke",
            ]
          + taint             = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @david-bour, Action: `pull_request`*